[
  {
    "path": "posts/2021-06-01-a-estatistica-e-os-dados-decifrando-o-dialogo/",
    "title": "A Estatística e os Dados: decifrando o diálogo",
    "description": "Quando eu entrei no curso de Estatística, uma das primeiras cadeiras que realizei como calouro era chamada de <b>Estatística Descritiva<\/b>. Com o tempo, aprendendo mais sobre a área de dados, entendi que aquela simples cadeira estava, na verdade, me ensinando o funcionamento do nosso mundo.",
    "author": [
      {
        "name": "Nicolas Hahn",
        "url": {}
      }
    ],
    "date": "2021-06-01",
    "categories": [],
    "contents": "\nQuando eu entrei no curso de Estatística, uma das primeiras cadeiras que realizei como calouro era chamada de Estatística Descritiva. Com o tempo, aprendendo mais sobre a área de dados, entendi que aquela simples cadeira estava, na verdade, me ensinando o funcionamento do nosso mundo. Como? Apenas explicando o conceito de Estatística (como ciência) e suas áreas. Mas calma meu povo e minha pova; vamos por partes!\nA Estatística como Ciência\n\nColeta de Dados;\nOrganização de Dados;\nAnálise de Dados;\nInterpretação de Dados.\n\nA Estatística como Ciência compreende todos esses itens acima, pois ela é rica em ferramentas que auxiliam na tomada de decisões. Graças a isso, ela é de grande utilidade para as mais diversas áreas do conhecimento - engenharia, computação, física, química -, bem como setores do mercado - saúde, finanças, indústria, educação, tecnologia.\nEstatística Descritiva\nO foco dessa área, como o próprio nome já diz, é descrever dados (associados a contagens, gráficos) e extrair a informação de interesse. Muito do que aprendi do objetivo do Business Intellingence é uma evolução ou adaptação empresarial do objetivo da estatística descritiva. Vamos ilustrar com um exemplo:\n\nExemplo: Considere uma empresa que venda um determinado produto. Ela contém 2 vendedores. Gostaríamos de saber quantas vendas cada um realizou ao longo do ano, bem como a venda média mensal de cada um.\n\nInicialmente, para resolvermos este problema, precisamos registrar quantas vendas cada um realizou ao longo do período (Coleta de Dados). Após isso, Organizar os Dados (tabulando, por exemplo) para que possa ser feita a extração de informações.\n\n\nmes\n\n\nvendedor\n\n\nvendas\n\n\n1\n\n\nA\n\n\n5\n\n\n2\n\n\nA\n\n\n3\n\n\n3\n\n\nA\n\n\n2\n\n\n4\n\n\nA\n\n\n14\n\n\n5\n\n\nA\n\n\n20\n\n\n6\n\n\nA\n\n\n4\n\n\n7\n\n\nA\n\n\n6\n\n\n8\n\n\nA\n\n\n1\n\n\n9\n\n\nA\n\n\n2\n\n\n10\n\n\nA\n\n\n1\n\n\n11\n\n\nA\n\n\n5\n\n\n12\n\n\nA\n\n\n3\n\n\n1\n\n\nB\n\n\n1\n\n\n2\n\n\nB\n\n\n5\n\n\n3\n\n\nB\n\n\n7\n\n\n4\n\n\nB\n\n\n9\n\n\n5\n\n\nB\n\n\n4\n\n\n6\n\n\nB\n\n\n3\n\n\n7\n\n\nB\n\n\n5\n\n\n8\n\n\nB\n\n\n6\n\n\n9\n\n\nB\n\n\n8\n\n\n10\n\n\nB\n\n\n5\n\n\n11\n\n\nB\n\n\n2\n\n\n12\n\n\nB\n\n\n1\n\n\nApós isso, podemos facilitar a visualização por meio de gráficos, bem como calcular algumas medidas para respondermos nossa pergunta.\n\n\n\nPode-se observar, pelo gráfico acima, que o vendedor A realizou mais vendas no mês 5 (maio) do que o vendedor B, assim como o vendedor B vendeu mais no mês 9 (setembro) do que o vendedor A. Para facilitar a comparação, realizaremos o cálculo da média anual de vendas para identificar quem vendeu mais (em média).\n\n\nvendedor\n\n\nmedia\n\n\nA\n\n\n5.50\n\n\nB\n\n\n4.67\n\n\nCom base na tabela acima e nos dados, temos que, em média, o vendedor A vende 5.50 unidades e o vendedor B 4.67 unidades por mês. Ou seja, o vendedor A vende cerca de uma unidade a mais do que o vendedor B (em média).\nEstatística Inferencial\nAlguma vez você já ouviu alguma notícia ou leu uma manchete que dizia algo como “95% das pessoas acreditam que comer faz bem” e pensou: “Ué, mas não perguntaram isso para mim.” ? Pois é, este é o objetivo dessa área da Estatística - obter conclusões sobre um todo (população) com base nos dados de uma parcela menor desse todo (amostra). Você pode pensar: mas isso funciona? SIM! Quando você (amigo, familiar) cozinha uma sopa, é normal experimentar um pouco para averiguar, por exemplo, se está salgada ou não. Esse pouco nada mais é do que uma amostra da tua sopa, e com ela pode-se concluir se a sopa está salgada ou não. Claro que temos incerteza envolvida; o processo de indução não é exato. No entanto, podemos calcular até quanto estamos errando por meio da Teoria de Probabilidades. Vou ilustrar com um exemplo.\n\nConsidere que em uma sala há 500 tigelas cheias de sopas. Em 250 delas (50%), a sopa está salgada. Sorteareamos, de forma aleatória, 50 sopas (10%) para distribuir para nossos convidados e eles nos informarão se a sopa está salgada ou não. Será que dessas 50 sopas, teremos cerca de 25 (metade de 50) salgadas?\n\n\n\n\nComo podemos notar nos gráficos acima, nossa amostra errou um pouco a proporção de sopas salgadas e não salgadas. No entanto, podemos notar que o erro foi de apenas 2% (cima e baixo). Claro que existirão casos com diferentes erros (alguns mais extremos do que outros), mas minha ideia foi mostrar que mesmo não sendo exato, podemos obter uma aproximação boa por meio da amostra. Utilizando a teoria de probabilidades, podemos calcular até que ponto nossas induções estão erradas.\nÀqueles que chegaram até aqui, agradeço a atenção. Quaisquer dúvidas, sugestões e críticas que tiverem, por favor deixem nos comentários. Vou adorar o feedback!\n\n\n\n",
    "preview": "posts/2021-06-01-a-estatistica-e-os-dados-decifrando-o-dialogo/a-estatistica-e-os-dados-decifrando-o-dialogo_files/figure-html5/unnamed-chunk-2-1.png",
    "last_modified": "2021-12-31T23:21:35-03:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-06-01-graficos-comuns-na-analise-de-dados/",
    "title": "Gráficos Comuns na Análise de Dados",
    "description": "Entender os gráficos é muito importante, pois de nada adianta olharmos para eles e não sabermos o que está sendo, de fato, mostrado.",
    "author": [
      {
        "name": "Nicolas Hahn",
        "url": {}
      }
    ],
    "date": "2021-06-01",
    "categories": [],
    "contents": "\nEntender os gráficos é muito importante, pois de nada adianta olharmos para eles e não sabermos o que está sendo, de fato, mostrado. Além disso, a visualização de dados veio para ficar, tanto que softwares como PowerBI e Tableau estão cada vez mais presentes nas empresas. Por quê? Auxiliam na criação de insights e contribuem para a tomada de decisão.\nExiste uma gama de tipos de gráficos, no entanto citarei apenas cinco gráficos básicos que são comuns na hora de analisar os dados. Minha ideia não é destrinchar cada tipo, apenas dar uma noção básica de como cada um funciona. Futuramente, pretendo realizar um post exclusivo para cada tipo.\nGráfico de Dispersão (scatterplot)\n\n\n\nA principal utilidade do gráfico de dispersão é o de averiguar a interação entre as variáveis (seja de dependência ou de independência). Acima, por exemplo, podemos notar que conforme a variável x aumenta, a variável y também aumenta.\nHistograma\n\n\n\nA grande utilidade do histograma é analisar a distribuição de frequência dos dados. Como assim? Perceba no gráfico exemplo acima que as barras verticais são mais altas ao redor do centro zero (eixo x) e, conforme vamos nos afastando do centro, as barras diminuem, ou seja, os valores são menos frequentes quanto mais nos afastamos do centro.\nBoxplot\n\n\n\nMuito útil para avaliar a distribuição dos dados, além de ser possível compararmos dois ou mais grupos de forma visual. No exemplo acima, estou utilizando o conjunto de dados Iris e avaliando a distribuição da largura da sépala das três espécies - setosa, versicolor e virginica - e, como podemos notar, a sépala da setosa é mais larga do que a das outras espécies comparadas.\nGráfico de Setores (ou de Pizza)\n\n\n\nMuito utilizado para comparar grupos. Os valores de cada categoria (tamanho da fatia da pizza) são proporcionais às respectivas frequências. No exemplo acima, mesmo com a omissão dos números, é possível deduzir que a letra D aparece mais do que todas as outras.\nGráfico de Barras (horizontal) ou Colunas (vertical)\n\n\n\nBasicamente, é uma demostração visual das frequências (contagem) de cada item. Considere o exemplo acima como uma fruteira: ao observar o gráfico, temos que o número de melancias presentes é maior do que o das outras frutas.\nEsses são apenas alguns gráficos e estão entre os mais comuns. Você conhecia eles? Tem algum que você não entendeu? Comente abaixo!\n\n\n\n",
    "preview": "posts/2021-06-01-graficos-comuns-na-analise-de-dados/graficos-comuns-na-analise-de-dados_files/figure-html5/unnamed-chunk-1-1.png",
    "last_modified": "2021-12-27T23:01:52-03:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-06-01-juros-simples-ou-compostos-visualize-a-diferenca/",
    "title": "Juros Simples ou Compostos Visualize a Diferenca",
    "description": "Muitas pessoas não gostam de matemática, e acreditam que muito do que aprenderam no colégio não usarão na vida. No entanto, independentemente da profissão que cada um optou, existe uma área da matemática que interefere diretamente no nosso dia a dia: \\*\\*Matemática Financeira!\\*\\*",
    "author": [
      {
        "name": "Nicolas Hahn",
        "url": {}
      }
    ],
    "date": "2021-06-01",
    "categories": [],
    "contents": "\nMuitas pessoas não gostam de matemática, e acreditam que muito do que aprenderam no colégio não usarão na vida. No entanto, independentemente da profissão que cada um optou, existe uma área da matemática que interefere diretamente no nosso dia a dia: Matemática Financeira!\nPromoções, descontos, parcelamentos, empréstimos, financianciamentos, investimentos. Nosso mundo gira muito em torno desses e outros itens que afetam diretamente nossas compras e vendas - e consequentemente, nosso bolso. Além disso, lidar com bancos e instituições financeiras é recorrente na atualidade e, devido a isso, entender o comportamento dos famosos JUROS é importante para que tenhamos uma boa saúde financeira. Portanto, meu povo e minha pova, vou tentar demonstrar para vocês como eles funcionam.\nJuros\n\nExemplo: Considere que você solicite um empréstimo de R$50,00 para seu amigo. Para convencê-lo a lhe emprestar, você informa que irá pagá-lo com juros de R$10,00. Logo, você pagará ao seu amigo o valor de R$60,00.\n\nBasicamente, os juros nada mais são do que uma remuneração cobrada pelo empréstimo do dinheiro (ou outro item) - se preferir, considere como uma espécie de “aluguel” do dinheiro. Observando o exemplo, vamos analisar pela fórmula:\n\\[\n\\begin{split}\n  Valor Futuro (VF) & = Valor Presente(VP) + Juros(J) \\\\\n                    & = 50 + 10 \\\\\n                    & = 60\n\\end{split}\n\\]\nNormalmente, os juros são expressos como um percentual (a famosa taxa de juros) e podem ser calculados de duas formas: simples ou compostos.\nJuros Simples\nNesse caso, a taxa de juros é aplicada sempre sobre o valor inicial ou presente (\\(VP\\)) em todos os períodos (dias, meses, anos).\n\nExemplo: Considere que você solicite um empréstimo de R\\$1000,00 e que irá pagar em 12 meses. A taxa de juros que será cobrada será de 10% ao mês no regime de juros simples. Quanto você irá pagar após os 12 meses?\n\nIrei demonstrar em 3 partes:\ncomo calcular a dívida com a fórmula;\na evolução da dívida por meio de uma tabela;\no gráfico para visualizar o crescimento da dívida.\nPrimeiro, vale lembrar que \\(10\\% = \\frac{10}{100} = 0.10\\).\n\\[\n  \\begin{split}\n  VF & = VP \\times (1 + taxadejuros(i) \\times tempo(t)) \\\\\n                    & = 1000 \\times (1 + 0.10 \\times 12) \\\\\n                    & = 1000 \\times (1 + 1,2) \\\\\n                    & = 1000 + 1200 \\\\\n                    & = 2200 \\\\\n\\end{split}\n\\]\nComo foi visto pela fórmula, seria pago o valor de R\\$2200,00. Agora, vamos ver a evolução da dívida por meio uma tabela e de um gráfico.\n\n\nMês\n\n\nValor Futuro (em R$)\n\n\n0\n\n\n1000\n\n\n1\n\n\n1100\n\n\n2\n\n\n1200\n\n\n3\n\n\n1300\n\n\n4\n\n\n1400\n\n\n5\n\n\n1500\n\n\n6\n\n\n1600\n\n\n7\n\n\n1700\n\n\n8\n\n\n1800\n\n\n9\n\n\n1900\n\n\n10\n\n\n2000\n\n\n11\n\n\n2100\n\n\n12\n\n\n2200\n\n\n\nJuros Compostos\nNesse caso, a taxa de juros é aplicada sempre sobre o valor futuro do período anterior. É por causa disso que esse regime de juros (que é o mais comum em nossos dias de hoje) entra em uma “bola de neve”. Vamos utilizar o mesmo exemplo anterior, mas com juros compostos:\n\nExemplo: Considere que você solicite um empréstimo de R\\$1000,00 e que irá pagar em 12 meses. A taxa de juros que será cobrada será de 10% ao mês no regime de juros compostos. Quanto você irá pagar após os 12 meses?\n\nNovamente, começaremos pela fórmula:\n\\[\n  \\begin{split}\n  VF & = VP \\times (1 + i)^t \\\\\n     & = 1000 \\times (1 + 0.10)^{12} \\\\\n     & = 1000 \\times (1.10)^{12} \\\\\n     & = 1000 \\times 3,138428 \\\\\n     & = 3138,43 \\\\\n\\end{split}\n\\]\nComo foi visto pela fórmula, seria pago o valor de R\\$3138,43. Agora, vamos ver a evolução da dívida por meio uma tabela e de um gráfico.\n\n\nMês\n\n\nValor Futuro (em R$)\n\n\n0\n\n\n1000.00\n\n\n1\n\n\n1100.00\n\n\n2\n\n\n1210.00\n\n\n3\n\n\n1331.00\n\n\n4\n\n\n1464.10\n\n\n5\n\n\n1610.51\n\n\n6\n\n\n1771.56\n\n\n7\n\n\n1948.72\n\n\n8\n\n\n2143.59\n\n\n9\n\n\n2357.95\n\n\n10\n\n\n2593.74\n\n\n11\n\n\n2853.12\n\n\n12\n\n\n3138.43\n\n\n\nComparando\nPara facilitar, creio que é válido colocar os números lado a lado.\n\n\nMês\n\n\nDívida (Juros Simples)\n\n\nDívida (Juros Compostos)\n\n\n0\n\n\n1000\n\n\n1000.00\n\n\n1\n\n\n1100\n\n\n1100.00\n\n\n2\n\n\n1200\n\n\n1210.00\n\n\n3\n\n\n1300\n\n\n1331.00\n\n\n4\n\n\n1400\n\n\n1464.10\n\n\n5\n\n\n1500\n\n\n1610.51\n\n\n6\n\n\n1600\n\n\n1771.56\n\n\n7\n\n\n1700\n\n\n1948.72\n\n\n8\n\n\n1800\n\n\n2143.59\n\n\n9\n\n\n1900\n\n\n2357.95\n\n\n10\n\n\n2000\n\n\n2593.74\n\n\n11\n\n\n2100\n\n\n2853.12\n\n\n12\n\n\n2200\n\n\n3138.43\n\n\n\nEm suma, é isso sobre os juros. Eles podem tanto serem usados a nosso favor (multiplicando nosso dinhero, no caso de investimentos), bem como contra nós (multiplicando nossa dívida, no caso de atrasos de pagamentos). Àqueles que chegaram até aqui, agradeço a atenção. Quaisquer dúvidas, sugestões e críticas que tiverem, por favor deixem nos comentários. Vou adorar o feedback!\n\n\n\n",
    "preview": "posts/2021-06-01-juros-simples-ou-compostos-visualize-a-diferenca/juros-simples-ou-compostos-visualize-a-diferenca_files/figure-html5/unnamed-chunk-1-1.png",
    "last_modified": "2022-01-01T00:23:21-03:00",
    "input_file": {}
  }
]
