[
  {
    "path": "posts/2021-06-01-graficos-comuns-na-analise-de-dados/",
    "title": "Gráficos Comuns na Análise de Dados",
    "description": "Entender os gráficos é muito importante, pois de nada adianta olharmos para eles e não sabermos o que está sendo, de fato, mostrado.",
    "author": [
      {
        "name": "Nicolas Hahn",
        "url": {}
      }
    ],
    "date": "2021-06-01",
    "categories": [],
    "contents": "\r\nEntender os gráficos é muito importante, pois de nada adianta olharmos para eles e não sabermos o que está sendo, de fato, mostrado. Além disso, a visualização de dados veio para ficar, tanto que softwares como PowerBI e Tableau estão cada vez mais presentes nas empresas. Por quê? Auxiliam na criação de insights e contribuem para a tomada de decisão.\r\nExiste uma gama de tipos de gráficos, no entanto citarei apenas cinco gráficos básicos que são comuns na hora de analisar os dados. Minha ideia não é destrinchar cada tipo, apenas dar uma noção básica de como cada um funciona. Futuramente, pretendo realizar um post exclusivo para cada tipo.\r\nGráfico de Dispersão (scatterplot)\r\n\r\n\r\n\r\nA principal utilidade do gráfico de dispersão é o de averiguar a interação entre as variáveis (seja de dependência ou de independência). Acima, por exemplo, podemos notar que conforme a variável x aumenta, a variável y também aumenta.\r\nHistograma\r\n\r\n\r\n\r\nA grande utilidade do histograma é analisar a distribuição de frequência dos dados. Como assim? Perceba no gráfico exemplo acima que as barras verticais são mais altas ao redor do centro zero (eixo x) e, conforme vamos nos afastando do centro, as barras diminuem, ou seja, os valores são menos frequentes quanto mais nos afastamos do centro.\r\nBoxplot\r\n\r\n\r\n\r\nMuito útil para avaliar a distribuição dos dados, além de ser possível compararmos dois ou mais grupos de forma visual. No exemplo acima, estou utilizando o conjunto de dados Iris e avaliando a distribuição da largura da sépala das três espécies - setosa, versicolor e virginica - e, como podemos notar, a sépala da setosa é mais larga do que a das outras espécies comparadas.\r\nGráfico de Setores (ou de Pizza)\r\n\r\n\r\n\r\nMuito utilizado para comparar grupos. Os valores de cada categoria (tamanho da fatia da pizza) são proporcionais às respectivas frequências. No exemplo acima, mesmo com a omissão dos números, é possível deduzir que a letra D aparece mais do que todas as outras.\r\nGráfico de Barras (horizontal) ou Colunas (vertical)\r\n\r\n\r\n\r\nBasicamente, é uma demostração visual das frequências (contagem) de cada item. Considere o exemplo acima como uma fruteira: ao observar o gráfico, temos que o número de melancias presentes é maior do que o das outras frutas.\r\nEsses são apenas alguns gráficos e estão entre os mais comuns. Você conhecia eles? Tem algum que você não entendeu? Comente abaixo!\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-06-01-graficos-comuns-na-analise-de-dados/graficos-comuns-na-analise-de-dados_files/figure-html5/unnamed-chunk-1-1.png",
    "last_modified": "2021-06-01T15:03:33-03:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Nicolas Hahn",
    "description": "Welcome to our new blog, Nicolas Hahn. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Nora Jones",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-06-01",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-01T15:18:46-03:00",
    "input_file": {}
  }
]
